In [12]:
import pandas as pd

In [13]:
coffees = pd.DataFrame({'Day':['Monday','Monday','Tuesday','Tuesday','Wednesday','Wednesday',
                              'Thursday','Thrusday','Friday','Friday','Saturday','Saturday','Sunday','Sunday'] , 
                              'Coffee Type' : ['Cortado','Latte','CAppuccino ','Mocha','Caffe machhiato','Cuban espresso','Espresso','Latte','Espresso',
                                                'Lattle','Flat white','Long Black','Espresso','Lattle'],
                              'Units Solid' : [25,15,30,20,35,25,40,30,45,35,45,50,55,60]

})

In [42]:
# Determining the size of out dataset (records, column)
coffees.shape

(14, 3)

In [18]:
# Rename columns
coffees.columns = ['Day', 'Coffee Type', 'Unit Solid']

In [6]:
coffees.columns = coffees.columns.str.strip().str.lower().str.replace('' ,'_').str.replace('|','').str.replace(')','')

In [3]:
coffees.head()

         Day      Coffee Type  Units Solid
0     Monday          Cortado           25
1     Monday            Latte           15
2    Tuesday      CAppuccino            30
3    Tuesday            Mocha           20
4  Wednesday  Caffe machhiato           35

In [26]:
data = pd.DataFrame({'first' : ['subham' , 'Ravi','Mohan','Sohan','Gita'],
                     'last': ['kumar','kumar','Rai','raj','kumar']})

In [28]:
data['first']= data['first'].str.upper()

In [33]:
# replace first column name 
data['first']= data['first'].str.replace('SUBHAM','Shubham')

In [35]:
data.dropna(how='all', inplace=True)

In [40]:
# add the white space  to left side
data['first']= data['first'].str.pad(0, side='right', fillchar='_')
data

          first   last
0  Shubham_____  kumar
1  RAVI________  kumar
2  MOHAN_______    Rai
3  SOHAN_______    raj
4  GITA________  kumar

marge first and lasst name

In [29]:
data['first'] + ' ' + data['last']

0    SUBHAM kumar
1      RAVI kumar
2       MOHAN Rai
3       SOHAN raj
4      GITA kumar
dtype: object

vreate new column of full_name

In [49]:
data['full_name'] = data['first'] + data['last']

dispaly

In [50]:
data

          first   last          full_name
0  Shubham_____  kumar  Shubham_____kumar
1  RAVI________  kumar  RAVI________kumar
2  MOHAN_______    Rai    MOHAN_______Rai
3  SOHAN_______    raj    SOHAN_______raj
4  GITA________  kumar  GITA________kumar

In [51]:
# drop multiple columns as 
data.drop(columns=['first','last'], axis=1, inplace=True)

In [ ]:
# data['full_name'].str.split( " , "  , expand=True)

# drop one column
#  data(['full_name'] , axis=1 , inplace=True)

In [ ]:
data.drop('first'), axis=1, inplace=True

    first   last    full_name
0  subham  kumar  subhamkumar
1    Ravi  kumar    Ravikumar
2   Mohan    Rai     MohanRai
3   Sohan    raj     Sohanraj
4    Gita  kumar    Gitakumar

In [65]:
coffees.drop(index=[4,5,6,7,8])

         Day  Coffee Type  Units Solid
0     Monday      Cortado           25
1     Monday        Latte           15
2    Tuesday  CAppuccino            30
3    Tuesday        Mocha           20
9     Friday       Lattle           35
10  Saturday   Flat white           45
11  Saturday   Long Black           50
12    Sunday     Espresso           55
13    Sunday       Lattle           60

In [8]:
coffe = coffees['Day'] == 'saturday'
coffee.drop(index=coffe[coffe].index)

NameError: name 'coffee' is not defined